/*
 * File: MyFun4.c
 *
 * MATLAB Coder version            : 4.3
 * C/C++ source code generated on  : 25-Sep-2022 20:58:03
 */

/* Include Files */
#include "MyFun4.h"
#include "MyFun4_data.h"
#include "MyFun4_initialize.h"
#include "fft.h"
#include "hilbert.h"
#include "rt_nonfinite.h"
#include <math.h>
#include <string.h>

/* Function Declarations */
static float rt_hypotd_snf(float u0, float u1);


/* Function Definitions */

/*
 * Arguments    : float u0
 *                float u1
 * Return Type  : float
 */
static float rt_hypotd_snf(float u0, float u1)
{
  float y;
  float a;
  a = fabs(u0);
  y = fabs(u1);
  if (a < y) {
    a /= y;
    y *= sqrt(a * a + 1.0);
  } else if (a > y) {
    y /= a;
    y = a * sqrt(y * y + 1.0);
  } else {
    if (!rtIsNaN(y)) {
      y = a * 1.4142135623730951;
    }
  }

  return y;
}

/*
 * t通过信号包络谱，计算绝对峰值，均方根，峰值因数，最后求得峰值因数平方的倒数
 *  资料显示，峰值因数越大，周期冲击特性越强，故障故障特征越明显
 * Arguments    : const float x[1024]
 *                float Fs
 *                float f_data[]
 *                int f_size[2]
 *                float *p3
 *                float *CrestFactor
 * Return Type  : void
 */
void MyFun4(const float x[1024], float Fs, float f_data[])
{
  creal32_T Ax[1024];
  int k;
  float b_Ax[1024];
  float Envdata[512];
  float p_tmp;
  float p[1024];
  int idx;
  bool exitg1;
  static const int iv[512] = { 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14,
    15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33,
    34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52,
    53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71,
    72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90,
    91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107,
    108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122,
    123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137,
    138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152,
    153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167,
    168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182,
    183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197,
    198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212,
    213, 214, 215, 216, 217, 218, 219, 220, 221, 222, 223, 224, 225, 226, 227,
    228, 229, 230, 231, 232, 233, 234, 235, 236, 237, 238, 239, 240, 241, 242,
    243, 244, 245, 246, 247, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257,
    258, 259, 260, 261, 262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 272,
    273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285, 286, 287,
    288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298, 299, 300, 301, 302,
    303, 304, 305, 306, 307, 308, 309, 310, 311, 312, 313, 314, 315, 316, 317,
    318, 319, 320, 321, 322, 323, 324, 325, 326, 327, 328, 329, 330, 331, 332,
    333, 334, 335, 336, 337, 338, 339, 340, 341, 342, 343, 344, 345, 346, 347,
    348, 349, 350, 351, 352, 353, 354, 355, 356, 357, 358, 359, 360, 361, 362,
    363, 364, 365, 366, 367, 368, 369, 370, 371, 372, 373, 374, 375, 376, 377,
    378, 379, 380, 381, 382, 383, 384, 385, 386, 387, 388, 389, 390, 391, 392,
    393, 394, 395, 396, 397, 398, 399, 400, 401, 402, 403, 404, 405, 406, 407,
    408, 409, 410, 411, 412, 413, 414, 415, 416, 417, 418, 419, 420, 421, 422,
    423, 424, 425, 426, 427, 428, 429, 430, 431, 432, 433, 434, 435, 436, 437,
    438, 439, 440, 441, 442, 443, 444, 445, 446, 447, 448, 449, 450, 451, 452,
    453, 454, 455, 456, 457, 458, 459, 460, 461, 462, 463, 464, 465, 466, 467,
    468, 469, 470, 471, 472, 473, 474, 475, 476, 477, 478, 479, 480, 481, 482,
    483, 484, 485, 486, 487, 488, 489, 490, 491, 492, 493, 494, 495, 496, 497,
    498, 499, 500, 501, 502, 503, 504, 505, 506, 507, 508, 509, 510, 511 };

  float x_tmp;
  float b_x[511];
  float p2; 
  float p3;
	float CrestFactor;
  if (isInitialized_MyFun4 == false) {
    MyFun4_initialize();
  }

  //(void)Fs;

  /*  确定采样频率：先采用12.8KHz，后续如何进行变换再确定 */
  /*  fs = 12800; */
  /*  求信号的包络谱 */
  /* [~,Envdata] = Envelope(x,fs);  */
//	printf("希尔伯特变换\r\n");
  hilbert(x, Ax);
//	for(k = 0; k < 1024; k++){
//		printf("%d\t%f\r\n", k, Ax[k]);
//	}
//	printf("\r\n");
  /*  解析信号 */
//	printf("解析信号\r\n");
  for (k = 0; k < 1024; k++) {
    b_Ax[k] = rt_hypotd_snf(Ax[k].re, Ax[k].im);
  }

  /*  求模 */
//	printf("fft\r\n");
  fft(b_Ax, Ax);

  /*  对信号做快速傅里叶变换 */
  /*  求信号的长度 */
  /*  长度为偶数 */
  /*  求频率 */
//	printf("频率\r\n");
  for (k = 0; k < 1024; k++) {
    p_tmp = 2.0 * rt_hypotd_snf(Ax[k].re, Ax[k].im) / 1024.0;
    p[k] = p_tmp;
    b_Ax[k] = p_tmp;
  }

  memcpy(&Envdata[0], &b_Ax[0], 512U * sizeof(float));

  /*  求振幅 */
  /*  对所得包络谱进行处理 */
  /*  振幅因数 */
  if (!rtIsNaN(Envdata[1])) {
    idx = 1;
  } else {
    idx = 0;
    k = 2;
    exitg1 = false;
    while ((!exitg1) && (k < 512)) {
      if (!rtIsNaN(Envdata[k])) {
        idx = k;
        exitg1 = true;
      } else {
        k++;
      }
    }
  }

  if (idx == 0) {
    p_tmp = p[1];
  } else {
    p_tmp = p[idx];
    idx++;
    for (k = idx; k < 512; k++) {
      if (p_tmp < p[iv[k]]) {
        p_tmp = p[k];
      }
    }
  }

  for (idx = 0; idx < 511; idx++) {
    x_tmp = Envdata[idx + 1];
    b_x[idx] = x_tmp * x_tmp;
  }

  x_tmp = b_x[0];
  for (k = 0; k < 510; k++) {
    x_tmp += b_x[k + 1];
  }

  CrestFactor = p_tmp / sqrt(x_tmp / 511.0);

  /* 振幅因数 */
  /*  根据包络谱求绝对峰值、均方根、峰值因数 */
  memcpy(&b_x[0], &Envdata[1], 511U * sizeof(float));
  if (!rtIsNaN(b_x[0])) {
    idx = 1;
  } else {
    idx = 0;
    k = 2;
    exitg1 = false;
    while ((!exitg1) && (k < 512)) {
      if (!rtIsNaN(b_x[k - 1])) {
        idx = k;
        exitg1 = true;
      } else {
        k++;
      }
    }
  }

  if (idx == 0) {
    p2 = b_x[0];
  } else {
    p2 = b_x[idx - 1];
    idx++;
    for (k = idx; k < 512; k++) {
      p_tmp = b_x[k - 1];
      if (p2 < p_tmp) {
        p2 = p_tmp;
      }
    }
  }

  /*  绝对峰值 */
  for (k = 0; k < 511; k++) {
    x_tmp = Envdata[k + 1];
    b_x[k] = x_tmp * x_tmp;
  }

  x_tmp = b_x[0];
  for (k = 0; k < 510; k++) {
    x_tmp += b_x[k + 1];
  }

  /*  均方根 */
  p3 = p2 / sqrt(x_tmp / 511.0);

  /*  峰值因数 */
  /*  最后求得峰值因子 */
  f_data[0] = 1.0 / (p3 * p3);
	f_data[1] = p3;
	f_data[2] = CrestFactor;

  /*  适应度函数为峰值因数的平方的倒数，峰值因数越大，周期冲击特性越强，故障特征越明显 */

}

/*
 * File trailer for MyFun4.c
 *
 * [EOF]
 */
